<template>
  <v-container>
    <v-flex class="ma-auto my-10">
      <div class="resultcomment" style="text-align:center; float:center">
        <h4 class="mb-10">{{ result }}</h4>
        <v-chip
          v-for="act in activty"
          :key="act"
          class="mt-2 my-2 mx-1"
          style="background-color:lightblue;"
          label
        >#{{ act }}</v-chip>
      </div>
    </v-flex>
  </v-container>
</template>

<script>
export default {
  name: "SurveyResultText",
  props: {
    mbti: { type: String, default: "" }
  },
  data() {
    return {
      activty: [],
      result: ""
    };
  },
  mounted() {
    this.setResultText();
  },
  methods: {
    setResultText() {
        alert(this.mbti);
      switch (this.mbti) {
        case "ISTJ":
          this.result =
            "진지하고 종종 혼자만의 여가를 가지는 그들은 집중과 철저함을 여가활동에 적용한다. 목적적이며 구체적인 결과물, 어느 정도의 기술 진보가 있는 활동들을 좋아한다. 놀이에 대한 접근이 신중하고 자발적이지 않는 경향이 있다.";
          this.activty = ["체스", "오락", "컴퓨터 게임", "에어로빅", "골프"];
          break;
        case "ISFJ":
          this.result =
            "그들의 여가활동은 소중한 사람들에 대한 헌신이며, 따라서 다른 사람들의 스포츠를 응원하는 자리에 있을 수 있다. 그들 자신의 여가시간을 사용함에 있어서 가까운 친구들과 친척들에게 충성스럽다. 소극적이지만 목적적이고 활동을 계획하는 것을 선호하며, 자주 그들의 신체적인 여건이나 또는 편안함을 조성하는 것을 중요하게 생각한다.";
          this.activty = ["특별한 저녁식사", "소풍", "산책", "영화감상"];
          break;
        case "INFJ":
          this.result =
            "그들의 독창성은 종종 독서나 음악-연주, 작곡, 감상-과 같은 사려 깊고 개인적인 활동을 통해 나타난다. 조용하면서 따뜻한 특성은 작고 친밀한 모임에 대한 선호에서 나타날지도 모른다. 그들의 신체적인 활동을 위한 에너지는 열의가 넘치는 다른 유형들에게 의기소침하게 보일정도로 적다. 다른 놀이는 예술적이고 문화적인 이벤트, 정보를 제공하는 독서와 미적인 물건들을 수집하는 것 등이 있다. ";
          this.activty = [
            "독서",
            "작곡",
            "음악 감상",
            "연극 감상",
            "문화",
            "예술"
          ];
          break;
        case "INTJ":
          this.result =
            "독창적인 마음과 더불어 전략적인 게임을 자주 즐긴다. 영화나 문화적인 이벤트에의 참석, 독서를 통하여 그들의 직관력에 도전하고 싶어 한다. 독립적인 성향 때문에 수영이나 무전여행 같은 개인스포츠에 끌릴 수도 있다. 여가활동의 성과에 대해 비판적인 경향이 있는데 그들은 전문적 지식이 더 중요하기 때문이다. 여가선택에서 심각하고 목적적이어서 박물관을 찾아가거나, 마라톤을 하거나, 새로운 주제를 공부하는 것에서 만족을 찾을 것이다. ";
          this.activty = ["전략게임", "독서", "마라톤", "공부", "수영"];
          break;
        case "ISTP":
          this.result =
            "그들의 여가활동은 초연한 호기심으로 특징지어지며, 동굴탐험이나 스카이다이빙을 하든지, 혼자 또는 모험을 즐기는 친구와 함께 하는 활동을 선택하는 경향이 있다. 기계-비행기, 제트기 스키, 소총 등-를 조작하는 것을 좋아한다. 자주 놀이에 익살스러운 유머를 가져오고, 주의나 계획의 가시적인 노력을 기울이지 않고도 놀이 활동으로 쉽게 옮겨가는 것 같다.";
          this.activty = [
            "양궁",
            "마술",
            "스쿠버다이빙",
            "레펠",
            "스카이다이빙"
          ];
          break;
        case "ISFP":
          this.result =
            "친한 친구와의 조용하고 우호적인 관계나 편안한 상태에서 시간을 보내는 것이 중요하다. 관계와 환경에서 조화에 초점을 맞추는 경향이 있다. 예술, 자연, 자연스런 후한 대접은 놀이 활동을 위한 좋은 선택이다. 조화에 대한 감각이 상하지 않는 한 여가활동에 대해 매우 태평스럽다.";
          this.activty = ["춤", "스키", "수영", "수공예 배우기", "파티"];
          break;
        case "INFP":
          this.result =
            "개인적인 열정을 지니며, 창조적 집필, 음악 연주, 일기 쓰기, 사진촬영과 같은 예술적인 활동을 즐기는 경향이 있고 언어에 대한 애정으로 시, 인용문, 책을 수집할 지도 모른다. 친밀하고 비공식적인 만남을 좋아하고, 의례적인 큰 모임은 싫어한다. 비록 여가활동을 통해 혼자 시간을 보내고 개인적인 표현을 하고 싶어 하는 강한 욕구가 있지만, 일에 전념함으로써 이것을 소홀히 할 수도 있다.";
          this.activty = ["자연감상", "영화/공연 감상", "사진 촬영", "글쓰기"];
          break;
        case "INTP":
          this.result =
            "조용하고 내성적인 경향은 혼자 하는 여가활동을 선택하는 선호에서 나타난다. 파티나 의례적인 사교 모임 또는 스포츠를 즐기지 않을 것이다. 독서, 문화적인 이벤트 또는 체스와 같은 지적인 활동을 자주 즐긴다. 심사숙고하는 성향으로 개인적인 여가 시간이 필요하지만, 일을 충분하게 완료시켜야만 한다고 생각하기 때문에, 그들의 직관은 일에 머무르고 따라서 여가를 소홀히 하기 쉽다.";
          this.activty = ["배낭 여행", "하이킹", "명상", "독서", "체스"];
          break;
        case "ESTP":
          this.result =
            "경쟁적인 팀 스포츠를 통한 자극을 필요로 하고 그로 인해 활동적이 되는 경향이 있다. 여가활동에서 사람관계보다 활동과 경쟁이 더 중요하다. 깊은 사고를 필요로 하는 여가활동은 견디기 어려워하는 경향이 있지만, 육체적이거나 기계적인 기술은 재빨리 습득한다. ";
          this.activty = ["자동차 경주", "비행", "소프트볼", "배구", "복싱"];
          break;
        case "ESFP":
          this.result =
            "사교적이고 태평스럽고, 매우 사회적이며 큰 파티나 모임을 좋아한다. 모임 내에서 원기왕성하고 따뜻하며 우호적이다. 또한 팀 스포츠를 통하여 타인들과 쉽게 상호작용하며 재미있어 보이는 단체에 쉽게 합류하는 경향이 있다. 파티를 위해 무대를 꾸미거나 친구들을 위해 차양을 치는 것 등의 일을 즐길 지도 모른다.";
          this.activty = ["퍼즐 게임", "보드게임", "춤", "농구", "축구"];
          break;
        case "ENFP":
          this.result =
            "다양한 여가활동에 열정적인 열의를 가지고 있으며, 의례적이거나 분명한 것을 넘어서는 상상력이 풍부한 놀이를 좋아하는 경향이 있다. 활동적이며 스포츠, 모임에서 중심이 되는 사람들이고 예술을 감상하거나, 아마추어 연주가가 될 지도 모른다. 자주 많은 자극을 필요로 하고, 일 속으로 놀이의 요소를 가져오려고 노력한다.";
          this.activty = [
            "소설 읽기",
            "악기 연주",
            "노래",
            "영화 감상",
            "스포츠 활동"
          ];
          break;
        case "ENTP":
          this.result =
            "관습에 얽매이지 않는 환경에서 재미있는 사람들 주위에 있고 싶어 한다. 참신함에 대한 욕망으로 독특한 이벤트에 마음이 끌리고, 모험에 대한 애정으로 여행과 모험적 활동을 즐긴다. 여가활동에 관해 태평스러우며, 종종 계획하지 않는 것을 더 좋아한다.";
          this.activty = ["해외 여행", "모험", "탐험", "방탈출"];
          break;
        case "ESTJ":
          this.result =
            "실제적인 현실주의자로 주로 집을 수선하거나 온실을 짓는 것과 같은 생산적인 결과가 있는 활동들을 선택하는 경향이 있다. 일을 조직하거나 운영하는데 주도적인 역할을 하기 때문에 공동체조직이나 자원봉사활동이 좋은 여가활동이 될 수 있다. 자연에 대한 관심은 자연의 현상을 확인하고, 분류하도록 하기도 한다.";
          this.activty = ["골프", "인테리어", "봉사활동", "등산"];
          break;
        case "ESFJ":
          this.result =
            "마음이 온화하고 이야기하기를 좋아해서 위원회, 교회, 자원봉사자 활동, 또는 다른 단체 등에서 인기가 있고 활동적인 경향이 있다. 어쩌면 특별한 기회를 계획하고 실행하여 휴일, 가족 행사와 친구들의 모임을 축하하는 것을 즐길지도 모른다. 종종 타인에게 동정심이 있는 사람으로 비쳐지고, 사교적인 스포츠를 즐기는 경향이 있다. ";
          this.activty = ["합창", "배구놀이", "요리수업", "파티", "교회 활동"];
          break;
        case "ENFJ":
          this.result =
            "타인에 대한 관심으로 사교적인 행사에의 참석과 개인적인 표현을 하는 것을 즐길 지도 모른다. 문학과 예술을 감상하며, 다른 유형들 보다는 신체적인 활동과 경쟁적인 스포츠에 흥미를 덜 가지는 경향이 있다. 종종 계획적이고 조직적인 여가활동을 하고, 타인의 여가활동에 대해 책임이 있다고 느낄 것이다.";
          this.activty = [
            "독서",
            "박물관 견학",
            "사교모임 참석",
            "특선요리",
            "예술 감상"
          ];
          break;
        case "ENTJ":
          this.result =
            "열렬하고, 많은 활동들에서 사교적인 리더가 되며, 친구들의 모임이나 공동체를 조직하려 한다. 놀이는 보통 일이 끝났다고 느껴진 후에야 가능하다. 대체적으로 파티나 경쟁적인 스포츠를 즐긴다.";
          this.activty = ["요트", "골프", "파티", "축구", "복싱"];
          break;
        default:
          break;
      }
    }
  }
};
</script>

<style>
</style>